app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                <%= post.created_at.localtime.strftime("%d-%m-%Y %H:%M:%S") %> by
                <% @user = User.find_by_id(post.authorid) %>