app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "authorid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "wreerwr"], ["description", "wrewerewrewr"], ["authorid", "1"], ["created_at", "2015-08-21 18:30:16.017466"], ["updated_at", "2015-08-21 18:30:16.017466"]]
---
  def create
    @post = Post.new(post_params)

    @post.authorid = current_user.id

    if @post.save